{
  "selected_projects": [
    {
      "id": "1",
      "title": "Where Is Waldo -- fullstack photo tagging web app",
      "tech_stack": ["HTML", "CSS", "JavaScript", "React"],
      "code_url": "https://github.com/SizweMalobola/where_is_waldo",
      "preview_url": "https://sizwemalobola.github.io/where_is_waldo/",
      "assets_url": [
        "mockup3.jpg",
        "Where-s-Waldo.png",
        "Where-s-Waldo(4).png"
      ],
      "paragraph_array": [
        "Developer a web version of a British series of puzzle books called Where is Wally. This is a full-stack project which implements the use of React and related front-end concepts and the back-end functionality is handled by Firebase a BAAS.",
        "Used Firebase’s Realtime database to store the user’s name and score after the puzzle is completed.",
        "Used React life-cycle method to preform asynchronous tasks like fetching the score data from the Firebase Realtime database and setting timers."
      ]
    },
    {
      "id": "2",
      "title": "Battleship -- recreation of the classic Battleship board game with ReactJS",
      "tech_stack": ["HTML", "CSS", "JavaScript", "React"],
      "code_url": "https://github.com/SizweMalobola/Battleship",
      "preview_url": "https://sizwemalobola.github.io/Battleship/",
      "assets_url": ["mockup2.jpg", "Battleship(2).png", null],
      "paragraph_array": [
        "Recreated the classic battleship boardgame using React. Used Test Driven Development to write the core logic of the app after much consideration, I chose Jest as my test runner because it’s well documented and widely used in the JS community.",
        "Imported the core logic for the app into a gameController React component which controls the main game loop and other compenets that interact with the DOM.",
        "The project realied heavily on the use of core React concepts like props & state."
      ]
    },
    {
      "id": "3",
      "title": "Shopping Cart -- A simple online store where you can browse the catalogue and add/remove items to your cart",
      "tech_stack": ["HTML", "CSS", "JavaScript", "React"],
      "code_url": "https://github.com/SizweMalobola/Shopping_cart",
      "preview_url": "https://angry-hugle-6ea173.netlify.app/",
      "assets_url": ["mockup1.jpg", null, null],
      "paragraph_array": [
        "Built a simple online store where you can browse the catalogue and add/remove items from your cart, which demonstrates an understating of Routing in React. Used Figma to design the mockup of the site before writing any code.",
        "This project implements the use of React concepts and how you can be used to achieve the following features: Filter products by categories, Add and remove items from the shopping cart.",
        "Implemented localStorage API to prevent users from losing items they’ve moved into their cart, while navigating the rest of the site."
      ]
    },
    {
      "id": "4",
      "title": "Weather App -- allows users to enter a city name and receive current weather data",
      "tech_stack": ["HTML", "CSS", "JavaScript"],
      "code_url": "https://github.com/SizweMalobola/Weather_app",
      "preview_url": "https://sizwemalobola.github.io/Weather_app/",
      "assets_url": ["mockup4.1.jpg", "Weather-App.png", null],
      "paragraph_array": [
        "Built Weather Application that allows users to enter a city name and receive currently weather data using the OpenWeatherMap API. All cities with the specified name are displayed and a temperature unit, a toggle is available to switch between Celsius and Fahrenheit.",
        "This project implements the use of JavaScript concepts like ES6 Modules and also the use of asynchronous JS functionality like promises.",
        "Webpack was the go-to bundler when the number of my JS modules was getting out of hand."
      ]
    }
  ],
  "currently_working_on": [
    {
      "id": "in_the_works_1",
      "title": "Personal Blog",
      "tech_stack": ["???", "???", "???"],
      "code_url": "https://github.com/SizweMalobola",
      "preview_url": "https://github.com/SizweMalobola",
      "assets_url": ["undraw_under_construction_46pa.svg", null, null],
      "paragraph_array": ["project currently in the conceptual phase"]
    },
    {
      "id": "in_the_works_2",
      "title": "Berserk Tribute",
      "tech_stack": ["???", "???", "???"],
      "code_url": "https://github.com/SizweMalobola",
      "preview_url": "https://github.com/SizweMalobola",
      "assets_url": ["undraw_Process_re_gws7.svg", null, null],
      "paragraph_array": ["project currently in the conceptual phase"]
    }
  ]
}
